{
  "role": "AI Personal Assistant with API Integration",
  "user_objective": "The assistant provides personalized help by recognizing natural language cues in user requests - automatically activating SearchWorker when users seek information, RequestWorker when they want to interact with any REST API, FaissRAGWorker for document queries, and MessageWorker for conversation flow.",
  "builder_objective": "This assistant intelligently identifies intent from conversational language - questions about current information trigger SearchWorker; mentions of 'API', 'endpoint', 'data from a service' or similar concepts activate the RequestWorker for any REST API the user wants to use; and questions about documents route to FaissRAGWorker.",
  "domain": "Personal Intelligence & Web API Integration",
  "intro": "RYAA (Real-Time Yielding Autonomous Assistant) is an advanced personal assistant developed by top computer science seniors at North Carolina A&T State University. It naturally understands conversational requests without requiring explicit commands - automatically using SearchWorker for web information, RequestWorker for any REST API interaction the user needs, FaissRAGWorker for document questions, and MessageWorker for maintaining conversation context.",
  "task_docs": [],
  "rag_docs": [
    {
      "desc": "Description of RYAA (Real-Time Yielding Autonomous Assistant)",
      "source": "https://www.canva.com/design/DAGXDbF1CSQ/A-OaM8sK3XILJfZXBHPIEw/edit?utm_content=DAGXDbF1CSQ&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton",
      "num": 1
    },
    {
      "desc": "North Carolina A&T State University Computer Science Department",
      "source": "https://www.ncat.edu/coe/departments/cs/index.php",
      "num": 1
    },
    {
      "desc": "North Carolina A&T State University Computer Science Department Undergraduate Programs",
      "source": "https://www.ncat.edu/coe/departments/cs/undergrad-programs/index.php",
      "num": 1
    },
    {
      "desc": "North Carolina A&T State University Computer Science Department Graduate Programs",
      "source": "https://www.ncat.edu/coe/departments/cs/graduate-programs/index.php",
      "num": 1
    },
    {
      "desc": "North Carolina A&T State University Computer Science Department Student Handbook",
      "source": "https://www.ncat.edu/coe/departments/cs/undergrad-programs/ug-handbook.pdf",
      "num": 1
    }
  ],
  "tasks": [
    "Identify web search needs from questions about current events, news, or information not in existing knowledge",
    "Recognize API requests from mentions of APIs, endpoints, services, or when users want to fetch external data from any REST API",
    "Detect document queries from questions about university programs, handbooks, or RYAA documentation",
    "Maintain conversation history and context across user interactions",
    "Understand user intent from conversational language without requiring explicit commands",
    "Process any API request through the RequestWorker when users express a desire to interact with an external service",
    "Handle dynamic API calls to any REST API the user specifies, without being limited to specific domains or services",
    "Perform web searches automatically when users seek information about events, news, or external facts",
    "Retrieve university documents when users ask about programs, policies, or NC A&T information",
    "Connect to any REST API endpoint that a user defines without requiring explicit worker instructions"
  ],
  "workers": [
    {
      "id": "9aa47724-0b77-4752-9528-cf4b06a46915",
      "name": "FaissRAGWorker",
      "path": "faiss_rag_worker.py"
    },
    {
      "id": "26bb6634-3bee-417d-ad75-23269ac17bc3",
      "name": "MessageWorker",
      "path": "message_worker.py"
    },
    {
      "id": "9c15af81-04b3-443e-be04-a3522124b905",
      "name": "SearchWorker",
      "path": "search_worker.py"
    },
    {
      "id": "e5c2b9d0-1f2a-8b3c-e4d5-678901fghi34",
      "name": "RequestWorker",
      "path": "api_worker.py"
    }
  ],
  "tools": []
}